#include <stdio.h>

int main()//프로그램 진입점
{   
    //16진수 0x12345678
    //0001 0010 0011 0100 0101 0110 0111 1000

    //10진수 출력
    printf("%d\n", 10);
    printf("%d\n", 010);//8진수 10(8진수) = 8+0 = 8
    printf("%d\n", 0x10);//16진수 10(16진수)16+0 = 16

    //8진수 출력
    printf("%o\n", 10);//8+2 =>12(8진수)
    printf("%o\n", 010);//10
    printf("%o\n", 0x10);//16진수 10(16진수)16+0 = 16 =>20(8진수)


    //16진수 출력
    printf("%x\n", 10); //a
    printf("%x\n", 010);//8 
    printf("%x\n", 0x10);//10

    printf("%p\n", 10);
    printf("%p\n", 010); 
    printf("%p\n", 0x10);

}